test-results/load-test-tools/gatling/2.3/coordinatedOmission_wrong-way/coordinatedOmission.yaml
execution:
- executor: gatling
  concurrency: 100
  ramp-up: 1s
  hold-for: 250s
  scenario: benchmark

scenarios:
  benchmark:
    default-address: http://172.31.10.4:3001

    headers:
      Accept-Encoding: gzip

    requests:
    - url: /api/json/coordinatedOmission
      method: GET
      body:
        slowAfter: 100  # s
        slowDuration: 100  # s
        sleep: 50  # s
      assert:
      - contains:
        - 200
        subject: http-code

    properties:
      gatling.http.ahc.connectTimeout: 10000
      gatling.http.ahc.requestTimeout: 60000